#####################################################################################################################
################################################## Test data: #######################################################
#####################################################################################################################
#Петрова Ольга 100 90
#Селезнёва Алиса 90 100
#Калиниченко Иван 30 70
#Иванов Сергей 70 30
#Симонов Семён 29 31
#Борисов Андрей 31 29
#####################################################################################################################
##################################################### Data: #########################################################
#####################################################################################################################
class CApplicant:
    surname = None
    name = None
    points = {}

    def __init__(self, surname, name, points):
        self.surname = surname
        self.name = name
        self.points = points

    def show_info(self):
        print("%s %s" % (self.surname, self.name))
#####################################################################################################################
##################################################### Funcs: ########################################################
#####################################################################################################################
def main():
    max_applicants = 500
    min_point = 30
    applicant_count = int(input("Количество участников: "))
    if applicant_count > max_applicants:
        print("Участников больше %i!" % max_applicants)
        exit(1)
    
    applicant_list = list()
    max_point = 0

    print("Введите имена участников:")
    applicant_index = 0
    while applicant_index < applicant_count:
        full_name = input()
        points = [None] * 2

        # Обработка данных участника.
        surname, name, points[0], points[1] = full_name.split(" ")
        points = list(map(int, points))
        max_point = max(points)
        if max_point > 100 or max_point < 0:
            print("Ошибка в количестве баллов!")
            print("Повторите попытку ввода.")
            continue
       
        if len(surname) > 20:
            print("Фамилия слишком длинная!")
            print("Повторите попытку ввода.")
            continue

        if len(name) > 15:
            print("Имя слишком длинное!")
            print("Повторите попытку ввода.")
            continue
        
        # Инициализация объектов класса учаник.
        applicant = CApplicant(surname, name, points)
        
        # Добавление в общий список учеников.
        applicant_list.append(applicant)
        applicant_index += 1

    # Поиск всех учеников с наивысшим баллом.
    not_past_applicant = list()
    for applicant in applicant_list:
        if applicant.points[0] < min_point or applicant.points[1] < min_point:
            not_past_applicant.append(applicant)

    # Вывод призёров.
    print("Не допущенных к сдаче экзаменов в первом потоке:")
    for applicant in not_past_applicant:
        applicant.show_info()
#####################################################################################################################
##################################################### Exec: #########################################################
#####################################################################################################################
main()